In [1]:
# Introduction to SQL and Advanced Functions
# Note: This notebook includes both theoretical and practical SQL questions.
# SQLite is used here for executing SQL commands in Colab.

import sqlite3
import pandas as pd

# Create in-memory database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# =========================================================
# Question 1 :
 Explain the fundamental differences between DDL, DML, and DQL commands in SQL. Provide one example for each type of command.
# =========================================================

Answer:

DDL (Data Definition Language) — Defines the structure of the database.
Example: CREATE TABLE Products (ProductID INT, ProductName VARCHAR(50));

DML (Data Manipulation Language) — Manages and modifies data stored in tables.
Example: INSERT INTO Products VALUES (101, 'Laptop');

DQL (Data Query Language) — Retrieves data from the database.
Example: SELECT * FROM Products;

# =========================================================
# Question 2 :
  What is the purpose of SQL constraints? Name and describe three common types of constraints, providing a simple scenario where each would be useful.
# =========================================================

Answer:

SQL Constraints ensure data integrity and accuracy.

1. PRIMARY KEY — Ensures each record is unique.
   Example: CustomerID in the Customers table must be unique.

2. FOREIGN KEY — Enforces a relationship between tables.
   Example: Product.CategoryID references Categories.CategoryID.

3. UNIQUE — Ensures no duplicate values.
   Example: Email field in the Customers table must be unique.

# =========================================================
# Question 3 :
Explain the difference between LIMIT and OFFSET clauses in SQL. How would you use them together to retrieve the third page of results, assuming each page has 10 records?
# =========================================================

Answer:

LIMIT defines how many rows to return.
OFFSET defines from which row to start returning data.

To get the third page (10 records per page):
LIMIT 10 OFFSET 20;

This skips the first 20 records (2 pages × 10) and shows the next 10.

# =========================================================
# Question 4 :
What is a Common Table Expression (CTE) in SQL, and what are its main benefits? Provide a simple SQL example demonstrating its usage.
# =========================================================

Answer:

A CTE (Common Table Expression) is a temporary result set defined within a query.
Benefits:
- Improves readability.
- Helps in recursive queries.
- Simplifies complex joins and subqueries.

Example:
WITH TopProducts AS (
    SELECT ProductName, Price
    FROM Products
    WHERE Price > 100
)
SELECT * FROM TopProducts;

# =========================================================
# Question 5 :
  Describe the concept of SQL Normalization and its primary goals. Briefly explain the first three normal forms (1NF, 2NF, 3NF).
# =========================================================

Answer:

Normalization organizes data to reduce redundancy and improve data integrity.

1NF — Each cell holds a single value.

2NF — Must be in 1NF and every non-key attribute depends on the whole primary key.

3NF — Must be in 2NF and every non-key attribute depends only on the primary key, not on other non-key attributes.

In [16]:
# Question 6:
# Create a database named ECommerceDB and perform the following tasks:

# 1️⃣ Create the following tables with appropriate data types and constraints:

# ● Categories
#   ○ CategoryID (INT, PRIMARY KEY)
#   ○ CategoryName (VARCHAR(50), NOT NULL, UNIQUE)

# ● Products
#   ○ ProductID (INT, PRIMARY KEY)
#   ○ ProductName (VARCHAR(100), NOT NULL, UNIQUE)
#   ○ CategoryID (INT, FOREIGN KEY → Categories)
#   ○ Price (DECIMAL(10,2), NOT NULL)
#   ○ StockQuantity (INT)

# ● Customers
#   ○ CustomerID (INT, PRIMARY KEY)
#   ○ CustomerName (VARCHAR(100), NOT NULL)
#   ○ Email (VARCHAR(100), UNIQUE)
#   ○ JoinDate (DATE)

# ● Orders
#   ○ OrderID (INT, PRIMARY KEY)
#   ○ CustomerID (INT, FOREIGN KEY → Customers)
#   ○ OrderDate (DATE, NOT NULL)
#   ○ TotalAmount (DECIMAL(10,2))

# 2️⃣ Insert the following records into each table:

# ● Categories
# | CategoryID | CategoryName |
# |-------------|--------------|
# | 1           | Electronics  |
# | 2           | Books        |
# | 3           | Home Goods   |
# | 4           | Apparel      |

# ● Products
# | ProductID | ProductName           | CategoryID | Price   | StockQuantity |
# |------------|----------------------|-------------|---------|----------------|
# | 101        | Laptop Pro           | 1           | 1200.00 | 50             |
# | 102        | SQL Handbook         | 2           | 45.50   | 200            |
# | 103        | Smart Speaker        | 1           | 99.99   | 150            |
# | 104        | Coffee Maker         | 3           | 75.00   | 80             |
# | 105        | Novel : The Great SQL| 2           | 25.00   | 120            |
# | 106        | Wireless Earbuds     | 1           | 150.00  | 100            |
# | 107        | Blender X            | 3           | 120.00  | 60             |
# | 108        | T-Shirt Casual       | 4           | 20.00   | 300            |

# ● Customers
# | CustomerID | CustomerName      | Email                | JoinDate   |
# |-------------|------------------|----------------------|-------------|
# | 1           | Alice Wonderland | alice@example.com    | 2023-01-10  |
# | 2           | Bob the Builder  | bob@example.com      | 2022-11-25  |
# | 3           | Charlie Chaplin  | charlie@example.com  | 2023-03-01  |
# | 4           | Diana Prince     | diana@example.com    | 2021-04-26  |

# ● Orders
# | OrderID | CustomerID | OrderDate  | TotalAmount |
# |----------|-------------|-------------|--------------|
# | 1001     | 1           | 2023-04-26  | 1245.50      |
# | 1002     | 2           | 2023-10-12  | 99.99        |
# | 1003     | 1           | 2023-07-01  | 145.00       |
# | 1004     | 3           | 2023-01-14  | 150.00       |
# | 1005     | 2           | 2023-09-24  | 120.00       |
# | 1006     | 1           | 2023-06-19  | 20.00        |

In [17]:
# =========================================================
# Answer
# Create a database named ECommerceDB and perform the following tasks:
# =========================================================

# (In Google Colab demonstration using SQLite3)

import sqlite3
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

# Create Tables
cursor.execute("""
CREATE TABLE Categories (
    CategoryID INTEGER PRIMARY KEY,
    CategoryName TEXT NOT NULL UNIQUE
);
""")

cursor.execute("""
CREATE TABLE Products (
    ProductID INTEGER PRIMARY KEY,
    ProductName TEXT NOT NULL UNIQUE,
    CategoryID INTEGER,
    Price DECIMAL(10,2) NOT NULL,
    StockQuantity INTEGER,
    FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
);
""")

cursor.execute("""
CREATE TABLE Customers (
    CustomerID INTEGER PRIMARY KEY,
    CustomerName TEXT NOT NULL,
    Email TEXT UNIQUE,
    JoinDate DATE
);
""")

cursor.execute("""
CREATE TABLE Orders (
    OrderID INTEGER PRIMARY KEY,
    CustomerID INTEGER,
    OrderDate DATE NOT NULL,
    TotalAmount DECIMAL(10,2),
    FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);
""")

# Insert Records
cursor.executemany("INSERT INTO Categories VALUES (?,?)", [
    (1, 'Electronics'),
    (2, 'Books'),
    (3, 'Home Goods'),
    (4, 'Apparel')
])

cursor.executemany("INSERT INTO Products VALUES (?,?,?,?,?)", [
    (101, 'Laptop Pro', 1, 1200.00, 50),
    (102, 'SQL Handbook', 2, 45.50, 200),
    (103, 'Smart Speaker', 1, 99.99, 150),
    (104, 'Coffee Maker', 3, 75.00, 80),
    (105, 'Novel: The Great SQL', 2, 25.00, 120),
    (106, 'Wireless Earbuds', 1, 150.00, 100),
    (107, 'Blender X', 3, 120.00, 60),
    (108, 'T-Shirt Casual', 4, 20.00, 300)
])

cursor.executemany("INSERT INTO Customers VALUES (?,?,?,?)", [
    (1, 'Alice Wonderland', 'alice@example.com', '2023-01-10'),
    (2, 'Bob the Builder', 'bob@example.com', '2022-11-25'),
    (3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-01'),
    (4, 'Diana Prince', 'diana@example.com', '2021-04-26')
])

cursor.executemany("INSERT INTO Orders VALUES (?,?,?,?)", [
    (1001, 1, '2023-04-26', 1245.50),
    (1002, 2, '2023-10-12', 99.99),
    (1003, 1, '2023-07-01', 145.00),
    (1004, 3, '2023-01-14', 150.00),
    (1005, 2, '2023-09-24', 120.00),
    (1006, 1, '2023-06-19', 20.00)
])

conn.commit()
print("Database and Tables Created Successfully with Records!")

Database and Tables Created Successfully with Records!

# =========================================================
# Question 7 :
Generate a report showing CustomerName, Email, and the
TotalNumberofOrders for each customer. Include customers who have not placed any orders, in which case their TotalNumberofOrders should be 0. Order the results by CustomerName.
# =========================================================

In [15]:

query = """
SELECT
    c.CustomerName,
    c.Email,
    COUNT(o.OrderID) AS TotalNumberofOrders
FROM Customers c
LEFT JOIN Orders o ON c.CustomerID = o.CustomerID
GROUP BY c.CustomerID
ORDER BY c.CustomerName;
"""
for row in cursor.execute(query):
    print(row)

('Alice Wonderland', 'alice@example.com', 3)
('Bob the Builder', 'bob@example.com', 2)
('Charlie Chaplin', 'charlie@example.com', 1)
('Diana Prince', 'diana@example.com', 0)

# =========================================================
# Question 8 :
Retrieve Product Information with Category: Write a SQL query to display the ProductName, Price, StockQuantity, and CategoryName for all products. Order the results by CategoryName and then ProductName alphabetically.
# =========================================================

In [13]:
query = """
SELECT
    p.ProductName,
    p.Price,
    p.StockQuantity,
    c.CategoryName
FROM Products p
JOIN Categories c ON p.CategoryID = c.CategoryID
ORDER BY c.CategoryName, p.ProductName;
"""
for row in cursor.execute(query):
    print(row)

('T-Shirt Casual', 20, 300, 'Apparel')
('Novel: The Great SQL', 25, 120, 'Books')
('SQL Handbook', 45.5, 200, 'Books')
('Laptop Pro', 1200, 50, 'Electronics')
('Smart Speaker', 99.99, 150, 'Electronics')
('Wireless Earbuds', 150, 100, 'Electronics')
('Blender X', 120, 60, 'Home Goods')
('Coffee Maker', 75, 80, 'Home Goods')

# =========================================================
# Question 9 :
Write a SQL query that uses a Common Table Expression(CTE) and a Window Function (specifically ROW_NUMBER() or RANK()) to display the CategoryName, ProductName, and Price for the top 2 most expensive products in each CategoryName.

# =========================================================

In [14]:
query = """
WITH RankedProducts AS (
    SELECT
        c.CategoryName,
        p.ProductName,
        p.Price,
        ROW_NUMBER() OVER (PARTITION BY c.CategoryName ORDER BY p.Price DESC) AS rn
    FROM Products p
    JOIN Categories c ON p.CategoryID = c.CategoryID
)
SELECT CategoryName, ProductName, Price
FROM RankedProducts
WHERE rn <= 2;
"""
for row in cursor.execute(query):
    print(row)

('Apparel', 'T-Shirt Casual', 20)
('Books', 'SQL Handbook', 45.5)
('Books', 'Novel: The Great SQL', 25)
('Electronics', 'Laptop Pro', 1200)
('Electronics', 'Wireless Earbuds', 150)
('Home Goods', 'Blender X', 120)
('Home Goods', 'Coffee Maker', 75)

# =========================================================
# Question 10 :
 You are hired as a data analyst by Sakila Video Rentals, a global movie rental company. The management team is looking to improve decision-making by analyzing existing customer, rental, and inventory data.

Using the Sakila database, answer the following business questions to support key strategic initiatives.

###Tasks & Questions:

1. Identify the top 5 customers based on the total amount they’ve spent. Include customer
name, email, and total amount spent.
2. Which 3 movie categories have the highest rental counts? Display the category name
and number of times movies from that category were rented.
3. Calculate how many films are available at each store and how many of those have
never been rented.
4. Show the total revenue per month for the year 2023 to analyze business seasonality.
5. Identify customers who have rented more than 10 times in the last 6 months
# =========================================================

Answer (Sample SQL Queries):

1️⃣ Top 5 customers by spending:

SELECT c.first_name, c.last_name, c.email, SUM(p.amount) AS TotalSpent

FROM payment p

JOIN customer c ON p.customer_id = c.customer_id

GROUP BY c.customer_id

ORDER BY TotalSpent DESC

LIMIT 5;

2️⃣ Top 3 movie categories by rental counts:

SELECT cat.name AS CategoryName, COUNT(r.rental_id) AS RentalCount

FROM rental r

JOIN inventory i ON r.inventory_id = i.inventory_id

JOIN film_category fc ON i.film_id = fc.film_id

JOIN category cat ON fc.category_id = cat.category_id

GROUP BY cat.name

ORDER BY RentalCount DESC

LIMIT 3;

3️⃣ Films available per store & never rented:

SELECT s.store_id,
       COUNT(i.inventory_id) AS TotalFilms,
       SUM(CASE WHEN r.rental_id IS NULL THEN 1 ELSE 0 END) AS NeverRented

FROM inventory i

LEFT JOIN rental r ON i.inventory_id = r.inventory_id

JOIN store s ON i.store_id = s.store_id

GROUP BY s.store_id;

4️⃣ Monthly revenue for 2023:

SELECT strftime('%Y-%m', payment_date) AS Month, SUM(amount) AS Revenue

FROM payment

WHERE strftime('%Y', payment_date) = '2023'

GROUP BY Month

ORDER BY Month;

5️⃣ Customers with >10 rentals in last 6 months:

SELECT c.first_name, c.last_name, COUNT(r.rental_id) AS Rentals

FROM rental r

JOIN customer c ON r.customer_id = c.customer_id

WHERE r.rental_date >= DATE('now', '-6 months')

GROUP BY c.customer_id

HAVING COUNT(r.rental_id) > 10;